app/controllers/api/game_events_controller.rb

INSERT INTO "game_events" ("user_id", "game_id", "occured_at", "event_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["game_id", 1], ["occured_at", "2021-06-28 01:50:18"], ["event_type", "completed"], ["created_at", "2021-06-28 02:04:27.705111"], ["updated_at", "2021-06-28 02:04:27.705111"]]
---
  def create
    @game_event = GameEvent.new(game_event_params)
    @game_event.user_id = @user.id

    if @game_event.valid?
      @game_event.save