app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username", "full_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.create(user_params)